In [1]:
import sqlite3

# connect (or create if doesnt exist) a local database, or use :memory: to run a databse in memory and not save it
# conn = sqlite3.connect('my_test_database.db')
conn = sqlite3.connect(':memory:')

# define the cursor used to do things in SQL
c = conn.cursor()

In [2]:
# use c.execute to run SQL commands
# SQL commands are not case sensitive but it's convention to write them in UPPERCASE
c.execute("CREATE TABLE lab_members (id INTEGER PRIMARY KEY, first TEXT, last TEXT, pay INTEGER)")

In [3]:
# Inserting new entries
c.execute("INSERT INTO lab_members VALUES (1, 'Sam', 'Qian', 37000)")
c.execute("INSERT INTO lab_members VALUES (2, 'Sam', 'Galindo', 39000)")

# Sometimes you'd want to insert using variables in python, in this case use the ? substitution
new_member = [(3, 'Anita','Burgos', 45000),(4, 'Rebecca','Vaadia',38000)]
for i in new_member:
    c.execute("INSERT INTO lab_members VALUES (?, ?, ?, ?)", i)

In [4]:
# Selecting entries (SELECT is synonyous with view)
c.execute("SELECT * FROM lab_members WHERE first='Sam'")
c.fetchall()

[(1, u'Sam', u'Qian', 37000), (2, u'Sam', u'Galindo', 39000)]

In [5]:
# Selecting the whole table to view by ommitting WHERE ...
c.execute("SELECT * FROM lab_members")
c.fetchall()

[(1, u'Sam', u'Qian', 37000),
 (2, u'Sam', u'Galindo', 39000),
 (3, u'Anita', u'Burgos', 45000),
 (4, u'Rebecca', u'Vaadia', 38000)]

In [6]:
# The SELECT * indicates selection of all columns
# SELECT [name of column] will only select that column
c.execute("SELECT first FROM lab_members")
c.fetchall()

[(u'Sam',), (u'Sam',), (u'Anita',), (u'Rebecca',)]

In [7]:
# ORDER BY to sort
c.execute("SELECT * FROM lab_members ORDER BY pay")
c.fetchall()

[(1, u'Sam', u'Qian', 37000),
 (4, u'Rebecca', u'Vaadia', 38000),
 (2, u'Sam', u'Galindo', 39000),
 (3, u'Anita', u'Burgos', 45000)]

In [8]:
# Using aggregate functions to get things like max, min, sum, average, etc...
c.execute("SELECT SUM(pay) FROM lab_members")
c.fetchall()

[(159000,)]

In [9]:
# Using Groupby clause at the end of a query to collapse rows for aggregate functions calculators
c.execute("SELECT first, SUM(pay) FROM lab_members GROUP BY first")
c.fetchall()

[(u'Anita', 45000), (u'Rebecca', 38000), (u'Sam', 76000)]